In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\home\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
df=pd.read_csv('placement.csv')
df

,Sl.No.,Roll No.,Name of the Student,Company,CTC(Rs.inLakhs),Branch,Unnamed: 6
0,1,1.601210e+11,Meghana Sreeya Veeramallu,Atlassian,5990000,Computer Science & Engineering,NaN
1,2,1.601210e+11,Bhavana Kodali,Microsoft,4900000,Computer Science & Engineering,NaN
2,3,1.601210e+11,Parveen Arshia,Microsoft,4900000,Computer Science & Engineering,NaN
3,4,1.601210e+11,Asritha D,Salesforce,4450000,Computer Science & Engineering,NaN
4,5,1.601210e+11,Sai Sahithi Kosaraju,Salesforce,4450000,Computer Science & Engineering,NaN
...,...,...,...,...,...,...,...
490,491,1.601210e+11,Jupaka Jupaka Ravivarma,Axis Energy Group,400000,Civil Engineering,NaN
491,492,1.601210e+11,Pranay Kumar T,INOX Air Products Private Limited,375000,Chemical Engineering,NaN
492,493,1.601210e+11,Kurmapu Sai Kiran,INOX Air Products Private Limited,375000,Mechanical Engineering,NaN
493,494,1.601210e+11,Manideep Dasari,Dravin Engineering Pvt Ltd,375000,Mechanical Engineering,NaN
494,495,1.601210e+11,Mushini Narender,INOX Air Products Private Limited,375000,Mechanical Engineering,NaN

In [4]:
df1 = df[df['Branch']=='Computer Science & Engineering']
len(df1)

132

In [7]:
len(df1[df1['CTC(Rs.inLakhs)']<=950000])

66

In [8]:
len(df1[df1['Company']=='JPMorgan Chase & Co.'])

12

In [9]:
df2=set(df['Company'])
len(df2)

50

In [10]:
a=df[df['Branch']=='Computer Science & Engineering']
b=a['CTC(Rs.inLakhs)'].mode()[0]
print(b)
len(a[a['CTC(Rs.inLakhs)']==b])

600000

33

In [15]:
d=list(df1['CTC(Rs.inLakhs)'])
d.sort()
d

[425000,
 425000,
 445000,
 445000,
 445000,
 445000,
 445000,
 445000,
 450000,
 450000,
 450000,
 450000,
 450000,
 450000,
 450000,
 475000,
 500000,
 500000,
 520000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 600000,
 650000,
 760000,
 760000,
 760000,
 760000,
 760000,
 760000,
 760000,
 760000,
 760000,
 800000,
 900000,
 900000,
 900000,
 1000000,
 1000000,
 1000000,
 1050000,
 1050000,
 1050000,
 1050000,
 1100000,
 1100000,
 1100000,
 1200000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1332000,
 1600000,
 1600000,
 1630000,
 1770000,
 1770000,
 1770000,
 1770000,
 1770000,
 1770000,
 1770000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1900000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 1975000,
 2145666,
 2145666,
 2145666,
 2145666,
 2200000,
 2635000,
 4400000,
 4450000,
 4450000,
 4450000,
 4900000,
 4900000,
 5990000]

In [18]:
df1[df1['Branch']=='Computer Science & Engineering'][df1['CTC(Rs.inLakhs)']==d[0]]

,Sl.No.,Roll No.,Name of the Student,Company,CTC(Rs.inLakhs),Branch,Unnamed: 6
476,477,1.601210e+11,Sharon Joseph Enduri,UST,425000,Computer Science & Engineering,NaN
477,478,1.601210e+11,Shirisha Siddireddy,UST,425000,Computer Science & Engineering,NaN